[
  {
    "abstract": "Bellante and Garrison(1988) view both conventional Phillips curve analysis (focused on real wages) and the use of Hayekian triangles (focused on real interest) to be useful in explaining business cycles. Five econometric paper have been published, with New Keynesian, New Classical Phillps Curves and similar models of conventional Philips Curve Models, with one major difference, the real interest rate variable has been added.",
    "link": "",
    "location": "9,2,June,2014,page6-16",
    "publisher": "Banks and Bank Systems",
    "title": "Issues concerning Hayekian Triangles & Phillips Cures, with Real Wage and Real Interest variables"
  },
  {
    "abstract": "",
    "link": "",
    "location": "9,2,June,2014,page61-71",
    "publisher": "Banks and Bank Systems",
    "title": "Significance of Real Interest and Real Wages in the Temporary Inflation-Unemployment Trade-off: Some Evidence from Canadian data from 1935 through 2010"
  },
  {
    "abstract": "",
    "link": "",
    "location": "54,2,May. pages 153-171",
    "publisher": "Economia Internazionale",
    "title": "The Inflation-Unemployment Trade-off and the Significance of the Interest Rate: Some Evidence from United States Data from 1939 through 2007"
  },
  {
    "abstract": "Banking practices of variable loan rates are an important consideration in macroeconomics. This article argues that any empirical study on the inflation-unemployment trade-off requires the inclusion of the real interest rate in the model as any changes in the interest rate affect the capital use by the firms leading to an effect on the level of employment in the economy. To test the validity of this argument an empirical model is developed which includes the real interest rate as one of the explanatory variables in addition to inflation and real wages. The model is estimated using the annual time series data from the United Kingdom for the period from 1961 to 2005. The estimated results indicate that the interest rate variable is indeed significant in explaining the inflation-unemployment trade-off. A Wald test conducted also suggests that exclusion of real interest rate leads to a misspecification problem.",
    "link": "",
    "location": "Volume 5, Issue 1, 2010",
    "publisher": "Banks and Bank Systems",
    "title": "The inflation-unemployment trade-off and the significance of the interest rate: some evidence from the United Kingdom"
  },
  {
    "abstract": "In this paper, we show that any empirical test on the validity of the Phillips Curve should also include the real interest rate. Building on our earlier work, we test our proposition with Canadian data",
    "link": "",
    "location": "Vol. 60., 3 pp. 319-332, 2007",
    "publisher": "Economia Internazionale",
    "title": "Real wages, Real interest rates and the Phillips Curve: Evidence from Canadian Data"
  },
  {
    "abstract": "This article argues that any analysis of a Phillips curve should include the real interest rate in addition to inflation and real wages as any changes in the interest rate changes the labour–capital input mix in the production process leading to a change in the level of employment in the economy. To justify this argument a Phillips curve model is developed, which includes the real interest rate in addition to inflation and real wages. After the diagnosis of the time series properties of the data, an error correction model is developed and estimated using a set of US annual data from 1948 to 1996. The estimated parameters of the model do suggest that one should really take into consideration of the real interest rate while analysing the Phillips curve. A nonnested test (F-test) also suggests that the Phillips curve model with real interest rate as an additional variable performs better than the conventional method that does not include the real interest rate.",
    "link": "",
    "location": "2005, 37, 397–402",
    "publisher": "Applied Economics",
    "title": "Real wages, real interest rates, and the Phillips curve"
  },
  {
    "abstract": "This article analyses historical movements in the commodity futures market and its relationship to inflation. Specifically, the relationship between the Commodity Research Bureau (CRB) index and US inflation is investigated. The results show that the CRB index continues to be an effective early indicator of inflation. However, as the composition of the US economy changes, the CRB should continue to realign the index to maintain its longterm viability.",
    "link": "",
    "location": "16,2,December",
    "publisher": "Applied Economics Letters",
    "title": "The CRB Index as a leading Indicator of United States Inflation"
  },
  {
    "abstract": "The United States Unified Budget Act (UBA) was implemented in 1969. Subsequently, all federal revenues, even those designated as going to trust funds, were used to determine each current fiscal year's Unified Budget's size of the surplus or deficit. Social Security and other trust funds are held in trust and by mandate and all are used to hold Treasury securities. The time period of data used in this paper is from 1940 through 2012.",
    "link": "",
    "location": " 9,4,December,pages 8-12",
    "publisher": "Banks and Bank Systems",
    "title": "Issues to Consider: The Federal Unified Budget Act and the Lack of following Generally Accepted Accounting Principles and Implications for Future Liavilities"
  },
  {
    "abstract": "The present paper examines the evolutionary development of industrial policies related to the electronics industry in China and the impacts of such policies on the shaping of the industry. The future trend of the industry is also discussed in the paper and the policy focus of the Chinese Government is predicted.",
    "link": "",
    "location": "2007, 15, 3; 33 – 51",
    "publisher": "3China and World Economy",
    "title": "China's Industrial Policy in Relation to Electronics Manufacturing"
  },
  {
    "abstract": "For several years, reports from the Trustees of the Social Security system have warned us that at the current rate of benefits and given the current age structure of our population, the Social Security system will go broke sometime between 2038 and 2042. To address Social Security Trustees' concerns, President Bush, in his postelection speech, reported that one of the legacies of his administration would be to reform the Social Security system. Farm operators tend to be older, on average, than people in other populations, meaning that changes in Social Security would more likely be of near-term concern to them. Although there is still considerable debate on whether reform is necessary or desirable, this article reports on what a changed Social Security system might look like, and how changes in the system might affect farmers' need for additional savings.",
    "link": "",
    "location": "20, 2, pages 157-160",
    "publisher": "Choices",
    "title": "Farmers and Social Security Reform"
  },
  {
    "abstract": "The research presented in this paper is largely descriptive and represents an attempt to better understand the Legislative Fiscal Office and its operations. It seeks to answer several questions including: What are the duties assigned to the LFO by state law or legislative roles? When are these tasks performed? For whom? Which tasks receive priority? What is the LFO workload? What are their staffing levels? Are there functions that LFOs have assumed on their own?",
    "link": "",
    "location": "Fall,2000, page 63-86",
    "publisher": "Journal of Public Affairs and Isssues",
    "title": "What Do Legislative Fiscal Offices Do?"
  },
  {
    "abstract": "In this article issues concerning national commonalities and regional differences in the United States regarding private land and outdoor recreation are reviewed. Based on the particular cultural and political backgrounds of each region, it is hypothesized that landowners will exhibit degrees of differences in their attitudes regarding public access to private land. Data is from the latest decennial survey, the National Private Landowners Survey (NPLOS 1995-96), as well as from per capita state and local government spending on recreation, provided from the 1992 Census of Government. There is a discussion of the philosophical views on land in the United States, with some specifics for each region. It was found that there is a positive relationship between allowing public access to private land and the regional, state, and local spending on parks and recreation. The historical cultural differences between regions also seem to be of some importance, though not conclusive. Implications for marketing and income opportunities associated with fee-based private land recreation in different regions of the nation are discussed.",
    "link": "",
    "location": "6,1, pages 47-65",
    "publisher": "Journal of Hospitality and Leisure Marketing",
    "title": "Private Landowner Attitudes Concerning Public Access for Outdoor Recreation: Cultural and Political Factors in the United States"
  },
  {
    "abstract": "",
    "link": "",
    "location": "Champaign, Illinois: Sagamore Publishing, pages. 183-218",
    "publisher": "Outdoor Recreation in American Life: A National Assessment of Demand and Supply Trends",
    "title": "Private Lands and Outdoor Recreation in the United States"
  },
  {
    "abstract": "",
    "link": "",
    "location": "67, January, 1996. pages 15 - 42",
    "publisher": "Journalof the Alabama Academy of Science",
    "title": "An Economic Analysis of Municipal GovernmentalBudgeting:  The Case of the Birmingham, Alabama General Fund"
  },
  {
    "abstract": "Future demand projections reported in this paper indicate a steady increase in demand for outdoor recreational opportunities in U.S. regions where BLM lands are located. From a supply perspective, BLM lands represent \"prime targets\" for meeting increased recreational demand in the western U.S. The BLM will face the challenge of balancing increased recreation use with other multiple uses, and minimizing the negative environmental impacts of increased recreation use such as damages caused by motorized vehicles, horses and foot traffic. In the future, the BLM will also face management challenges related to financing the provision of increased recreational opportunities",
    "link": "",
    "location": "",
    "publisher": "",
    "title": "The role of the bureau of land management in the provision of outdoor recreatinal opportunities in the west"
  }
]
